# -*- coding: utf-8 -*-
import struct
import math
def long_to_bytes(n):
    s = b''
    pack = struct.pack
    while n > 0:
        s = pack('>I', n & 0xffffffff) + s
        n = n >> 32
    for i in range(len(s)):
        if s[i] != b'\000'[0]:
            break
    else:
        s = b'\000'
        i = 0
    s = s[i:]
    return s

#字节逆序
def byteinvert(str_bin):
    ret=''
    for i in range(len(str_bin)//8):
        ret+=str_bin[i*8:i*8+8][::-1]
    return ret

#标准曼彻斯特
def MCST_stand(str_bin):
    ret=''
    for i in range(len(str_bin)//2):
        x=str_bin[i*2:i*2+2]
        if x=='01':
            ret+='0'
        elif x=='10':
            ret+='1'
        else:
            return 'stand manchester decode wrong!'
    return ret

#IEEE规范的曼彻斯特
def MCST_IEEE(str_bin):
    ret=''
    for i in range(math.ceil(len(str_bin)/8)):
        x=str_bin[i*2:i*2+2]
        if x=='01':
            ret+='1'
        elif x=='10':
            ret+='0'
        else:
            return 'stand manchester decode wrong!'
    return ret

#差分曼彻斯特
def MCST_diff(str_bin):
    ret=''
    for i in range(0,len(str_bin)//2-1):
        x1=str_bin[i*2:i*2+2]
        x2=str_bin[i*2+2:i*2+4]
        if x1==x2:
            ret+='0'
        else:
            ret+='1'
    return ret

if __name__ == "__main__":
    str_bin = "01101001011010010110100110010110011010100101100101101001011001100110100101011001011010011001011001101010010110010110100101100101011010101001101001100101010110100110011001010110011001101010101001100101010101100110011001011010011001011001101001100110101010100110010110100110010110100110010101101001101010010110100101011010011010011001010101101001011001100110101001011010010110100110101001101001011001100110101001011001011010100101101001100110101010100110101001011001011010010101011001101001011001010110100110010110011010011010101001100110101010100110100101101001011010100101100101011010010110100110101001010110011010100110011001011010010110100110100110101001011010010101101001101010100101100110011010101010011001100101101001100101100110100110101010100110"
    # str_bin = "1011101110111011101110101011101010111110111010111011101110101010101110111110101110111010101110101011111011101011101110111010111110111111101011101010111111101110101010101111101010101011111111101010111111111010101010101110111010101110101011101010101111111110101011101110101011101110101011111011101011111011101110111110111010111010101111111011101110101010101111101110111011101110101111101011101110101010101111101110101110111110111011101010101111111110101111101110101110111011111110101011101110101111101110101011101010111010111111101010101111111110101110111011101110111110111010111110111011101110101111101111101010111110101010101110111011101110101110101111101110111011111011101011111110111010101010111111111010101010111011101010111010101110101111111110101"
    print(str_bin)
    m1 = MCST_IEEE(str_bin)
    m2 = MCST_stand(str_bin)
    m3 = MCST_diff(str_bin)
    print('\nIEEE曼彻斯特:')
    print(m1)
    print(hex(int(m1,2)))
    print(long_to_bytes(int(m1,2)))
    print('\n 标准曼彻斯特:')
    print(m2)
    print(hex(int(m2,2)))
    print(long_to_bytes(int(m2,2)))
    print('\n 差分曼彻斯特:')
    print(m3)
    print(hex(int(m3,2)))
    print(long_to_bytes(int(m3,2)))
    print('\n=============字节逆序=============')
    m1=byteinvert(m1)
    m2=byteinvert(m2)
    m3=byteinvert(m3)
    print('\nIEEE曼彻斯特:')
    print(m1)
    print(hex(int(m1,2)))
    print(long_to_bytes(int(m1,2)))
    print('\n 标准曼彻斯特:')
    print(m2)
    print(hex(int(m2,2)))
    print(long_to_bytes(int(m2,2)))
    print('\n 差分曼彻斯特:')
    print(m3)
    print(hex(int(m3,2)))
    print(long_to_bytes(int(m3,2)))

